load-test/get-load-fetch.yml
config:
  target: "http://localhost:3000"
  phases:
    - name: "POST Load test"
      duration: 60
      arrivalRate: 1000
scenarios:
  - name: Get exports
    flow:
      - get:
          url: "/export"
          qs:
            skip: 0
            limit: 50
  - name: Get imports
    flow:
      - get:
          url: "/import"
          qs:
            skip: 0
            limit: 50